Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/svd/PIC32CZ4010CA80208.svd
               <register>
                  <name>CHCTRLB</name>
                  <description>CHANNEL CONTROL REGISTER B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>WAS</name>
                        <description>Channel Write Address Sequence.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>WASSelect</name>
                           <enumeratedValue>
                              <name>BYTE_ADDR_INCR</name>
                              <description>Incrementing Address+1 with Transfers of Byte Operands</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF_WORD_ADDR_INCR</name>
                              <description>Incrementing Address+2 with Transfers of HalfWord Operands</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AUTO_ADDR_INCR</name>
                              <description>Auto Increment Address and Transfer Size</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_BYTE_ADDR_INCR</name>
                              <description>Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_HALF_WORD_ADDR_INCR</name>
                              <description>Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_WORD_ADDR_INCR</name>
                              <description>Fixed Address Word Burst Transfer</description>
                              <value>5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RAS</name>
                        <description>Channel Read Address Sequence</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>RASSelect</name>
                           <enumeratedValue>
                              <name>BYTE_ADDR_INCR</name>
                              <description>Incrementing Address+1 with Transfers of Byte Operands</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF_WORD_ADDR_INCR</name>
                              <description>Incrementing Address+2 with Transfers of HalfWord Operands</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AUTO_ADDR_INCR</name>
                              <description>Auto Increment Address and Transfer Size</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_BYTE_ADDR_INCR</name>
                              <description>Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_HALF_WORD_ADDR_INCR</name>
                              <description>Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FIXED_WORD_ADDR_INCR</name>
                              <description>Fixed Address Word Burst Transfer</description>
                              <value>5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PRI</name>
                        <description>Channel Priority level.</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PRISelect</name>
                           <enumeratedValue>
                              <name>PRI_1</name>
                              <description>Channel Priority is 1</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PRI_2</name>
                              <description>Channel Priority is 2</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PRI_3</name>
                              <description>Channel Priority is 3</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PRI_4</name>
                              <description>Channel Priority is 4 (HIGHEST)</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WBOEN</name>
                        <description>Write Byte Order Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BYTORD</name>
                        <description>Byte Order</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>BYTORDSelect</name>
                           <enumeratedValue>
                              <name>BYTORD_NONE</name>
                              <description>Bytes are processed AS IS</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTORD_WORD_SWIZZLE</name>
                              <description>Bytes are swapped as: BYTE3 to BYTE0, BYTE2 to BYTE1, BYTE1 to BYTE2, and BYTE0 to BYTE3</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTORD_HALF_WORD_SWIZZLE</name>
                              <description>Bytes are swapped as: BYTE3 to BYTE1, BYTE2 to BYTE0, BYTE1 to BYTE3, and BYTE0 to BYTE2</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTORD_BYTE_SWIZZLE</name>
                              <description>Bytes are swapped as: BYTE3 to BYTE2, BYTE2 to BYTE3, BYTE1 to BYTE1, and BYTE0 to BYTE1</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRIG</name>
                        <description>Trigger that can Start a Channel Transfer</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>PIGNEN</name>
                        <description>Enable Pattern Ignore Byte</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PATLEN</name>
                        <description>Pattern Match Length</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PATEN</name>
                        <description>Channel Pattern Match Abort Enable.</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CASTEN</name>
                        <description>Cell Auto Start Enable of Ensuing Transfers for this channel</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CRCEN</name>
                        <description>CRC Enable bit</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHEVCTRL</name>
                  <description>CHANNEL EVENT CONTROL REGISTER</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>EVAUXACT</name>
                        <description>Channel Auxiliary Event Input Action</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EVAUXACTSelect</name>
                           <enumeratedValue>
                              <name>ABORT_BLK_XFER</name>
                              <description>Event Aborts Bock Transfer</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INCR_CHN_PRI</name>
                              <description>Event Increments Channel Priority</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COND_TRIG</name>
                              <description>Event acts as a Conditional Trigger</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVOMODE</name>
                        <description>Channel Event Output Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EVOMODESelect</name>
                           <enumeratedValue>
                              <name>STRB_ON_BLCK_XFER</name>
                              <description>Generate a channel event strobe for 1 clock cycle at the end of block transfer</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STRB_ON_CELL_XFER</name>
                              <description>Generate a channel event strobe for 1 clock cycle at the end of cell transfer</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STRB_START_EVT_TRG_TO_CELL_XFER_READ</name>
                              <description>Generate a channel event strobe from start event trigger to the completion of cell transfer read</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STRB_START_EVT_TRG_TO_CELL_XFER_WRITE</name>
                              <description>Generate a channel event strobe from start event trigger to the completion of cell transfer write</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVAUXIE</name>
                        <description>Channel Auxiliary Event Enable (0: disable; 1: enable)</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVSTRIE</name>
                        <description>Channel Start Event Input Enable (0: disable; 1:enable)</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVOE</name>
                        <description>Channel Event Output Enable (0: disable; 1: enable)</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTENCLR</name>
                  <description>CHANNEL INTERRUPT ENABLE CLEAR REGISTER</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SD</name>
                        <description>Channel Event Output Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TA</name>
                        <description>Clear Transfer Abort Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CC</name>
                        <description>Clear Cell Transfer Complete Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BC</name>
                        <description>Clear Cell Transfer Complete Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BH</name>
                        <description>Clear Block Transfer Half Complete Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LL</name>
                        <description>Clear Linked List Done Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTENSET</name>
                  <description>CHANNEL INTERRUPT ENABLE SET REGISTER</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SD</name>
                        <description>Channel Event Output Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TA</name>
                        <description>Set Transfer Abort Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CC</name>
                        <description>set Cell Transfer Complete Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BC</name>
                        <description>set Cell Transfer Complete Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BH</name>
                        <description>set Block Transfer Half Complete Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LL</name>
                        <description>set Linked List Done Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTF</name>
                  <description>CHANNEL INTERRUPT FLAG REGISTER</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SD</name>
                        <description>Start Detected Interrupt Flag (0: none ; 1: Start Detected)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TA</name>
                        <description>Transfer Abort Interrupt Flag (0: none; 1: Transfer Aborted)</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CC</name>
                        <description>Cell Transfer Complete Interrupt Flag (0: none ; 1: complete)</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BC</name>
                        <description>Block Transfer Complete Interrupt Flag (0: none; 1:complete;)</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BH</name>
                        <description>Block Transfer Half Complete Interrupt Flag (0: none; 1: half complete)</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LL</name>
                        <description>Linked List Done Interrupt Flag (0: none; 1: done)</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WRE</name>
                        <description>Write Error Flag (0: none; 1: Write Error)</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RDE</name>
                        <description>Read Error Flag (0: none; 1: Read Error)</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHSSA</name>
                  <description>CHANNEL SOURCE START ADDRESS</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SSA</name>
                        <description>Channel Source Start Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHDSA</name>
                  <description>CHANNEL DESTINATION START ADDRESS</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DSA</name>
                        <description>Channel Destination Start Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHSSTRD</name>
                  <description>CHANNEL SOURCE CELL STRIDE SIZE REGISTER</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SSTRD</name>
                        <description>Source Cell Stride Size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
